In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('Db-IMDB.db')

![schema](db_schema.jpeg)

In [2]:
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('Movie',), ('Genre',), ('Language',), ('Country',), ('Location',), ('M_Location',), ('M_Country',), ('M_Language',), ('M_Genre',), ('Person',), ('M_Producer',), ('M_Director',), ('M_Cast',)]

1. List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that
the genre is 'Comedyâ€™ and year is a leap year) Your query should return director name, the
movie name, and the year.

In [3]:
# pd.read_sql_query("select distinct substr(year, -4) as sy from Movie ORDER BY sy", conn)

In [4]:
# pd.read_sql_query("select distinct m.title, m.year, g.Name 
#                   From GENRE g, Movie m, M_GENRE mg 
#                   where mg.GID = g.GID and TRIM(g.Name) = 'Comedy'", conn)

In [5]:
movie_df = pd.read_sql_query("select * from MOVIE", conn)
genre_df = pd.read_sql_query("select * from GENRE", conn)
mdir_df = pd.read_sql_query("select * from M_Director", conn)
person_df = pd.read_sql_query("select * from PERSON", conn)
mgen_df = pd.read_sql_query("select * from M_Genre", conn)
mcast_df = pd.read_sql_query("select * from M_Cast", conn)

In [6]:
r1 = pd.read_sql_query("""select distinct TRIM(p.name), m.title, substr(m.year, -4) as myear
                    from PERSON p, M_Director md, Movie m, M_GENRE mg, GENRE g
                    where mg.GID = g.GID and TRIM(g.Name) = 'Comedy'
                    and md.MID = m.MID and p.PID = TRIM(md.PID)
                    and ((myear % 4 = 0 and myear % 100 <> 0) OR myear % 400 = 0) 
                    ORDER BY myear;""", conn)
print(r1.shape)
r1.head()

(852, 3)

              TRIM(p.name)         title myear
0  Vishnupant Govind Damle  Sant Tukaram  1936
1              Franz Osten  Achhut Kanya  1936
2               P.C. Barua        Devdas  1936
3               Raj Kapoor           Aag  1948
4               S.U. Sunny          Mela  1948

In [7]:
person_df.head()

   index        PID                   Name  Gender
0      0  nm0000288         Christian Bale    Male
1      1  nm0000949         Cate Blanchett  Female
2      2  nm1212722   Benedict Cumberbatch    Male
3      3  nm0365140          Naomie Harris  Female
4      4  nm0785227            Andy Serkis    Male

In [8]:
pd.read_sql_query("select * from GENRE where Name LIKE '%Comedy%';", conn).head()

   index                                 Name  GID
0      1    Action, Comedy, Crime                1
1      6  Comedy, Crime, Thriller                6
2      8    Comedy, Drama, Family                8
3     10                   Comedy               10
4     13   Action, Comedy, Sci-Fi               13

In [9]:
r2 = pd.read_sql_query("""select distinct p.Name, mc.PID, m.title, substr(m.year, -4) as myear
                    from Movie m, M_Cast mc, PERSON p
                    where TRIM(m.title) = 'Anand' and TRIM(mc.MID) = TRIM(m.MID)
                    and TRIM(p.PID) = TRIM(mc.PID)
                    ORDER BY p.Name""", conn)
print(r2.shape)
r2.head()
# TRIM(p.name),  where , PERSON p, M_Cast mc,

(17, 4)

                Name         PID  title myear
0   Amitabh Bachchan   nm0000821  Anand  1971
1     Asit Kumar Sen   nm0783996  Anand  1971
2       Atam Prakash   nm0695155  Anand  1971
3     Brahm Bhardwaj   nm0080231  Anand  1971
4         Dara Singh   nm0802107  Anand  1971

In [22]:
# and mc.MID = m.MID
#                     and p.PID = TRIM(mc.PID)
#                     ORDER BY p.Name

In [14]:
mcast_df.head()

   index        MID         PID  ID
0      0  tt2388771   nm0000288   0
1      1  tt2388771   nm0000949   1
2      2  tt2388771   nm1212722   2
3      3  tt2388771   nm0365140   3
4      4  tt2388771   nm0785227   4

2. List the names of all the actors who played in the movie 'Anand' (1971)
3. List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970
and > 1990.)

In [21]:
r3 = pd.read_sql_query("""select p.Name, m.title, substr(m.year, -4) as myear
                          from Movie m, M_Cast mc, Person p
                          where (myear < 1970 OR myear > 1990)
                          and mc.MID = m.MID and TRIM(mc.PID) = p.PID
                          ORDER by myear""", conn)
print(r3.shape)
r3.head(5)
# TRIM(p.name),  where , PERSON p, M_Cast mc

(86850, 3)

                 Name     title myear
0   Prithviraj Kapoor  Alam Ara  1931
1              Elizer  Alam Ara  1931
2       Jagdish Sethi  Alam Ara  1931
3               Jillo  Alam Ara  1931
4           W.M. Khan  Alam Ara  1931

4.List all directors who directed 10 movies or more, in descending order of the number of
movies they directed. Return the directors' names and the number of movies each of them
directed.

In [33]:
r4 = pd.read_sql_query("""select distinct TRIM(p.name) as dir_name, Count(m.title) as mv_count
                         from PERSON p, M_Director md, Movie m
                         where md.MID = m.MID and p.PID = TRIM(md.PID)
                         GROUP BY dir_name having Count(dir_name) > 9
                         ORDER BY mv_count DESC;""", conn)
print(r4.shape)
r4.head()

(156, 2)

               dir_name  mv_count
0          David Dhawan        78
1          Mahesh Bhatt        72
2       Ram Gopal Varma        60
3          Vikram Bhatt        58
4  Hrishikesh Mukherjee        54

In [38]:
r5 = pd.read_sql_query("""select distinct  substr(m.year, -4) as m_year, m.title, Count(m.title) as mv_count
                         from PERSON p, M_Cast mc, Movie m
                         where p.Gender = 'Female'
                         and mc.MID = m.MID and TRIM(mc.PID) = p.PID
                         ORDER BY mv_count DESC;""", conn)
print(r5.shape)
r5.head()

(1, 3)

  m_year   title  mv_count
0   1994  Kanoon     23324

In [39]:
person_df.head()

   index        PID                   Name  Gender
0      0  nm0000288         Christian Bale    Male
1      1  nm0000949         Cate Blanchett  Female
2      2  nm1212722   Benedict Cumberbatch    Male
3      3  nm0365140          Naomie Harris  Female
4      4  nm0785227            Andy Serkis    Male

In [23]:
print(movie_df.columns)
print(genre_df.columns)
print(mdir_df.columns)
print(person_df.columns)
print(mgen_df.columns)
print(mcast_df.columns)

Index(['index', 'MID', 'title', 'year', 'rating', 'num_votes'], dtype='object')
Index(['index', 'Name', 'GID'], dtype='object')
Index(['index', 'MID', 'PID', 'ID'], dtype='object')
Index(['index', 'PID', 'Name', 'Gender'], dtype='object')
Index(['index', 'MID', 'GID', 'ID'], dtype='object')
Index(['index', 'MID', 'PID', 'ID'], dtype='object')

5.
a. For each year, count the number of movies in that year that had only female actors.
b. Now include a small change: report for each year the percentage of movies in that
year with only female actors, and the total number of movies made that year. For
example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were
13,522 movies, and 31.81% had only female actors. You do not need to round your
answer.
6. Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast
size" we mean the number of distinct actors that played in that movie: if an actor played
multiple roles, or if it simply occurs multiple times in casts, we still count her/him only
once.
7. A decade is a sequence of 10 consecutive years. For example, say in your database you have
movie information starting from 1965. Then the first decade is 1965, 1966, ..., 1974; the
second one is 1967, 1968, ..., 1976 and so on. Find the decade D with the largest number of
films and the total number of films in D.
8. Find the actors that were never unemployed for more than 3 years at a stretch. (Assume
that the actors remain unemployed between two consecutive movies).
9. Find all the actors that made more movies with Yash Chopra than any other director.
10. The Shahrukh number of an actor is the length of the shortest path between the actor and
Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all
actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who
acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc.
Return all actors whose Shahrukh number is 2.

 - 4.List all directors who directed 10 movies or more, in descending order of the number of
movies they directed. Return the directors' names and the number of movies each of them
directed.